{"vocabulary": {"99": 4999, "uses": 46286, "an": 6621, "insufficiently": 24200, "restrictive": 36560, "directive": 15832, "in": 22350, "the": 41497, "installed": 24108, "htaccess": 21637, "file": 18698, "which": 48602, "allows": 6431, "remote": 35949, "attackers": 9110, "to": 43773, "execute": 17911, "arbitrary": 8291, "php": 33014, "code": 12667, "by": 10978, "uploading": 45818, "files": 18888, "whose": 48731, "names": 29107, "contain": 13565, "feature": 18552, "editor": 16857, "admin": 5695, "media": 27933, "or": 31257, "mod": 28536, "are": 8395, "processed": 34263, "as": 8670, "types": 45185, "application": 8085, "httpd": 21732, "uses an": 46287, "an insufficiently": 6767, "in the": 23314, "the installed": 42169, "htaccess file": 21638, "file which": 18853, "which allows": 48606, "allows remote": 6489, "remote attackers": 35957, "attackers to": 9120, "to execute": 44121, "execute arbitrary": 17915, "arbitrary php": 8326, "php code": 33043, "code by": 12680, "by uploading": 11196, "uploading files": 45823, "which are": 48609, "are processed": 8501, "as php": 8745, "php file": 33052, "file types": 18836, "advanced": 5885, "faq": 18493, "manager": 27555, "plugin": 33374, "for": 19344, "wordpress": 49303, "is": 24716, "vulnerable": 47947, "unauthorized": 45339, "modification": 28602, "of": 30176, "data": 14878, "that": 41333, "can": 11462, "lead": 26198, "denial": 15352, "service": 38343, "due": 16539, "missing": 28418, "capability": 11603, "check": 12137, "on": 30720, "ajax": 6181, "action": 5448, "all": 6283, "versions": 47197, "up": 45673, "and": 6904, "including": 23523, "this": 43269, "makes": 27360, "it": 25222, "possible": 33647, "authenticated": 9232, "with": 48972, "subscriber": 40360, "level": 26323, "access": 5209, "above": 5143, "update": 45685, "option": 31229, "values": 46886, "site": 39026, "be": 9688, "leveraged": 26348, "would": 49397, "create": 14436, "error": 17511, "deny": 15357, "legitimate": 26275, "users": 46231, "used": 45982, "set": 38585, "some": 39506, "true": 45055, "such": 40407, "registration": 35807, "manager plugin": 27591, "plugin for": 33395, "for wordpress": 19612, "wordpress is": 49317, "is vulnerable": 25095, "vulnerable to": 47967, "to unauthorized": 44611, "unauthorized modification": 45359, "modification of": 28605, "of data": 30282, "data that": 14984, "that can": 41360, "can lead": 11522, "lead to": 26200, "to denial": 44051, "denial of": 15353, "of service": 30517, "service due": 38393, "due to": 16541, "to missing": 44332, "missing capability": 28424, "capability check": 11605, "check on": 12150, "on the": 30850, "ajax action": 6182, "action in": 5457, "in all": 22382, "all versions": 6317, "versions up": 47295, "up to": 45680, "to and": 43899, "and including": 7250, "including this": 23554, "this makes": 43351, "makes it": 27362, "it possible": 25272, "possible for": 33660, "for authenticated": 19374, "authenticated attackers": 9242, "attackers with": 9123, "with subscriber": 49133, "subscriber level": 40362, "level access": 26326, "access and": 5213, "and above": 6974, "above to": 5149, "to update": 44625, "values to": 46901, "to on": 44361, "the wordpress": 43087, "wordpress site": 49321, "site this": 39058, "this can": 43291, "can be": 11470, "be leveraged": 9778, "leveraged to": 26351, "update an": 45708, "an option": 6809, "option that": 31238, "that would": 41494, "create an": 14438, "an error": 6703, "error on": 17531, "the site": 42828, "site and": 39031, "and deny": 7114, "deny service": 15359, "service to": 38471, "to legitimate": 44290, "legitimate users": 26278, "users or": 46260, "or be": 31289, "be used": 9862, "used to": 46003, "to set": 44524, "some values": 39530, "to true": 44601, "such as": 40410, "prior": 34016, "14": 1744, "request": 36167, "smuggling": 39278, "attacks": 9126, "where": 48571, "backend": 9540, "frontend": 20097, "proxy": 34708, "also": 6541, "being": 10246, "http": 21683, "issues": 25203, "might": 28338, "incorrect": 23587, "content": 13662, "length": 26283, "transfer": 44884, "encoding": 17176, "header": 21223, "parsing": 32379, "conduct": 13259, "part": 32400, "chain": 12012, "servers": 38329, "insufficient": 24175, "prior to": 34034, "to 14": 43794, "14 allows": 1760, "request smuggling": 36212, "smuggling attacks": 39279, "is used": 25083, "used as": 45988, "issues and": 25204, "and request": 7491, "might be": 28341, "be possible": 9802, "possible due": 33657, "to incorrect": 44231, "content length": 13675, "length and": 26284, "transfer encoding": 44885, "encoding header": 17178, "header parsing": 21242, "it is": 25259, "is possible": 24967, "possible to": 33682, "to conduct": 43999, "conduct http": 13269, "http request": 21713, "as part": 8740, "part of": 32402, "chain of": 12016, "to insufficient": 44250, "tiny": 43709, "before": 9948, "there": 43201, "execution": 17977, "via": 47360, "upload": 45776, "from": 19992, "url": 45870, "edit": 16814, "rename": 36031, "only": 30952, "impacted": 22219, "file manager": 18786, "manager before": 27568, "before there": 10192, "there is": 43206, "is remote": 24999, "remote code": 35961, "code execution": 12688, "execution via": 18015, "via upload": 47499, "from url": 20083, "url and": 45873, "and edit": 7147, "authenticated users": 9259, "users are": 46238, "are impacted": 8463, "vulnerability": 47849, "mysql": 29046, "server": 38164, "product": 34310, "oracle": 31522, "component": 13065, "optimizer": 31226, "supported": 40528, "affected": 5951, "31": 3440, "easily": 16738, "exploitable": 18149, "low": 27121, "privileged": 34095, "attacker": 9058, "network": 29313, "multiple": 28946, "protocols": 34651, "compromise": 13145, "successful": 40395, "result": 36562, "ability": 5117, "cause": 11731, "hang": 20985, "frequently": 19983, "repeatable": 36066, "crash": 14397, "complete": 13041, "dos": 16298, "cvss": 14749, "base": 9622, "score": 37470, "availability": 9420, "impacts": 22225, "vector": 46988, "av": 9416, "ac": 5169, "pr": 33860, "ui": 45264, "vulnerability in": 47895, "the mysql": 42386, "mysql server": 29055, "server product": 38277, "product of": 34330, "of oracle": 30443, "oracle mysql": 31578, "mysql component": 29052, "component server": 13109, "server optimizer": 38268, "optimizer supported": 31227, "supported versions": 40532, "versions that": 47288, "that are": 41350, "are affected": 8429, "affected are": 5958, "are 31": 8413, "31 and": 3445, "and prior": 7445, "prior easily": 34026, "easily exploitable": 16740, "exploitable vulnerability": 18168, "vulnerability allows": 47855, "allows low": 6470, "low privileged": 27128, "privileged attacker": 34100, "attacker with": 9106, "with network": 49083, "network access": 29314, "access via": 5292, "via multiple": 47439, "multiple protocols": 28977, "protocols to": 34652, "to compromise": 43996, "compromise mysql": 13152, "server successful": 38295, "successful attacks": 40397, "attacks of": 9143, "of this": 30573, "this vulnerability": 43410, "vulnerability can": 47868, "can result": 11555, "result in": 36565, "in unauthorized": 23354, "unauthorized ability": 45340, "ability to": 5120, "to cause": 43967, "cause hang": 11742, "hang or": 20989, "or frequently": 31357, "frequently repeatable": 19984, "repeatable crash": 36067, "crash complete": 14405, "complete dos": 13045, "dos of": 16311, "of mysql": 30423, "server cvss": 38217, "cvss base": 14751, "base score": 9627, "score availability": 37472, "availability impacts": 9423, "impacts cvss": 22227, "cvss vector": 14754, "vector cvss": 46989, "cvss av": 14750, "av ac": 9417, "ac pr": 5171, "pr ui": 33861, "cross": 14562, "scripting": 37533, "xss": 49789, "do": 16155, "number": 29971, "analyzer": 6897, "dna": 16130, "cisco": 12295, "unified": 45458, "communications": 12993, "inject": 23863, "web": 48216, "script": 37495, "html": 21644, "unspecified": 45611, "parameter": 32274, "aka": 6189, "bug": 10831, "id": 21910, "cross site": 14568, "site scripting": 39052, "scripting xss": 37555, "xss vulnerability": 49827, "do in": 16157, "component in": 13087, "in cisco": 22500, "cisco unified": 12348, "unified communications": 45460, "communications manager": 12998, "manager allows": 27562, "to inject": 44243, "inject arbitrary": 23866, "arbitrary web": 8356, "web script": 48268, "script or": 37520, "or html": 31371, "html via": 21679, "via an": 47367, "an unspecified": 6857, "unspecified parameter": 45623, "parameter aka": 32275, "aka bug": 6195, "bug id": 10839, "division": 16079, "zero": 49939, "caused": 11781, "malformed": 27373, "input": 23965, "division by": 16080, "by zero": 11214, "caused by": 11782, "by malformed": 11103, "malformed input": 27378, "input file": 23984, "was": 48044, "classified": 12398, "problematic": 34199, "has": 21034, "been": 9905, "found": 19791, "sourcecodester": 39591, "human": 21771, "resource": 36407, "management": 27487, "system": 40694, "issue": 25136, "affects": 6011, "unknown": 45517, "processing": 34281, "add": 5550, "employee": 17101, "handler": 20943, "manipulation": 27638, "argument": 8551, "first": 19099, "name": 29067, "middle": 28322, "last": 26123, "leads": 26204, "attack": 9006, "may": 27767, "initiated": 23856, "remotely": 35997, "identifier": 21959, "vdb": 46983, "assigned": 8870, "vulnerability which": 47939, "which was": 48669, "was classified": 48060, "classified as": 12400, "as problematic": 8749, "problematic has": 34201, "has been": 21040, "been found": 9927, "found in": 19793, "in sourcecodester": 23250, "human resource": 21773, "resource management": 36415, "management system": 27542, "system this": 40811, "this issue": 43344, "issue affects": 25138, "affects some": 6059, "some unknown": 39529, "unknown processing": 45525, "processing of": 34288, "of the": 30568, "the component": 41765, "component add": 13066, "handler the": 20951, "the manipulation": 42315, "manipulation of": 27641, "the argument": 41579, "first name": 19106, "name last": 29082, "last name": 26126, "name leads": 29083, "leads to": 26205, "to cross": 44035, "scripting the": 37548, "the attack": 41599, "attack may": 9029, "may be": 27775, "be initiated": 9769, "initiated remotely": 23858, "remotely the": 36003, "the identifier": 42128, "identifier vdb": 21963, "was assigned": 48054, "assigned to": 8873, "to this": 44590, "clinics": 12544, "patient": 32640, "rated": 35259, "critical": 14533, "sql": 39844, "injection": 23892, "exploit": 18130, "disclosed": 15938, "public": 34750, "vulnerability was": 47936, "was found": 48068, "patient management": 32641, "system it": 40762, "it has": 25254, "been rated": 9937, "rated as": 35260, "as critical": 8697, "critical this": 14544, "the file": 41991, "php the": 33097, "from to": 20078, "to sql": 44547, "sql injection": 39852, "injection the": 23920, "the exploit": 41956, "exploit has": 18135, "been disclosed": 9921, "disclosed to": 15940, "to the": 44583, "the public": 42617, "public and": 34751, "and may": 7342, "buffer": 10789, "overflow": 31851, "imail": 22183, "client": 12472, "22": 2937, "shipped": 38746, "ipswitch": 24664, "2006": 2406, "long": 27041, "boundary": 10634, "multipart": 28943, "mime": 28363, "mail": 27290, "message": 28114, "buffer overflow": 10807, "overflow in": 31873, "as shipped": 8759, "shipped with": 38748, "ipswitch imail": 24665, "22 allows": 2962, "arbitrary code": 8295, "code via": 12730, "via long": 47430, "parameter in": 32293, "mail message": 27299, "path": 32587, "traversal": 44927, "allowing": 6410, "outside": 31829, "default": 15207, "folder": 19283, "servlet": 38530, "related": 35843, "jsp": 25636, "to path": 44390, "path traversal": 32614, "traversal allowing": 44928, "allowing access": 6411, "access to": 5287, "to system": 44571, "system files": 40745, "files outside": 18924, "outside the": 31832, "the default": 41841, "folder via": 19289, "via the": 47492, "file parameter": 18800, "parameter related": 32305, "related to": 35848, "draytek": 16414, "cgi": 11983, "bin": 10393, "mainfunction": 27325, "interface": 24334, "session": 38536, "os": 31668, "command": 12852, "upgrading": 45770, "version": 47078, "able": 5121, "address": 5619, "recommended": 35618, "upgrade": 45754, "critical has": 14539, "in draytek": 22615, "file cgi": 18725, "cgi bin": 11986, "mainfunction cgi": 27326, "component web": 13119, "web management": 48255, "management interface": 27520, "interface the": 24361, "to os": 44369, "os command": 31684, "command injection": 12871, "used upgrading": 46005, "upgrading to": 45775, "to version": 44653, "version is": 47159, "is able": 24722, "able to": 5122, "to address": 43879, "address this": 5646, "issue it": 25167, "is recommended": 24993, "recommended to": 35620, "to upgrade": 44627, "upgrade the": 45760, "the affected": 41539, "affected component": 5964, "phpmyadmin": 33135, "extension": 18304, "earlier": 16665, "typo3": 45200, "vectors": 46995, "extension and": 18306, "and earlier": 7145, "earlier for": 16695, "for typo3": 19588, "typo3 allows": 45201, "via unspecified": 47498, "unspecified vectors": 45631, "ios": 24562, "xe": 49677, "software": 39397, "could": 14062, "allow": 6356, "commands": 12902, "privileges": 34118, "root": 36811, "validation": 46820, "sending": 38005, "crafted": 14230, "underlying": 45412, "operating": 31162, "the web": 43056, "web ui": 48283, "feature of": 18564, "of cisco": 30246, "cisco ios": 12325, "ios xe": 24579, "xe software": 49678, "software could": 39412, "could allow": 14067, "allow an": 6358, "an authenticated": 6674, "authenticated remote": 9253, "remote attacker": 35956, "attacker to": 9099, "inject commands": 23868, "commands with": 12932, "with the": 49140, "the privileges": 42588, "privileges of": 34142, "of root": 30502, "root this": 36830, "vulnerability is": 47897, "is due": 24821, "insufficient input": 24188, "input validation": 24014, "validation an": 46823, "an attacker": 6669, "attacker could": 9073, "could exploit": 14083, "exploit this": 18143, "vulnerability by": 47867, "by sending": 11160, "sending crafted": 38009, "crafted input": 14285, "input to": 24013, "successful exploit": 40399, "exploit could": 18134, "allow the": 6387, "the attacker": 41601, "commands to": 12927, "the underlying": 42978, "underlying operating": 45417, "operating system": 31166, "system with": 40834, "with root": 49117, "root privileges": 36827, "google": 20670, "chrome": 12238, "10": 1111, "648": 4314, "204": 2850, "does": 16233, "not": 29663, "properly": 34503, "handle": 20922, "svg": 40582, "text": 41282, "possibly": 33691, "have": 21135, "other": 31728, "impact": 22204, "stale": 39987, "pointer": 33480, "google chrome": 20674, "chrome before": 12239, "before 10": 9959, "10 648": 1154, "does not": 16234, "not properly": 29782, "properly handle": 34524, "text which": 41301, "cause denial": 11738, "service or": 38434, "or possibly": 31446, "possibly have": 33704, "have unspecified": 21185, "unspecified other": 45622, "other impact": 31741, "impact via": 22218, "via unknown": 47497, "unknown vectors": 45527, "vectors that": 47009, "that lead": 41415, "to stale": 44550, "stale pointer": 39988, "uninitialized": 45474, "pdfium": 32731, "90": 4916, "4430": 3922, "72": 4536, "allowed": 6398, "obtain": 30081, "potentially": 33789, "sensitive": 38037, "information": 23726, "process": 34216, "memory": 28002, "pdf": 32717, "uninitialized data": 45475, "data in": 14925, "in pdfium": 23055, "pdfium in": 32732, "in google": 22717, "chrome prior": 12243, "to 90": 43858, "90 4430": 4918, "72 allowed": 4538, "allowed remote": 6405, "to obtain": 44359, "obtain potentially": 30098, "potentially sensitive": 33818, "sensitive information": 38045, "information from": 23746, "from process": 20059, "process memory": 34239, "memory via": 28075, "via crafted": 47382, "crafted pdf": 14330, "pdf file": 32721, "ithemes": 25317, "builder": 10877, "theme": 43158, "depot": 15388, "30": 3301, "add_query_arg": 5576, "remove_query_arg": 36018, "before 30": 10011, "wordpress has": 49316, "has xss": 21104, "xss via": 49825, "via add_query_arg": 47363, "add_query_arg and": 5577, "and remove_query_arg": 7486, "index": 23640, "page": 32118, "injection vulnerability": 23927, "in index": 22767, "index php": 23658, "php in": 33061, "arbitrary sql": 8345, "sql commands": 39848, "commands via": 12929, "the page": 42483, "page parameter": 32153, "busybox": 10937, "use": 45954, "salt": 37233, "when": 48441, "generating": 20468, "passwords": 32523, "easier": 16735, "local": 26798, "guess": 20844, "stolen": 40135, "password": 32467, "using": 46313, "techniques": 41124, "rainbow": 35217, "tables": 40918, "not use": 29825, "when generating": 48492, "passwords which": 32541, "which makes": 48644, "it easier": 25246, "easier for": 16736, "for local": 19479, "local users": 26845, "users to": 46272, "to guess": 44183, "passwords from": 32529, "password file": 32481, "file using": 18847, "adobe": 5844, "animate": 7759, "21": 2866, "out": 31792, "bounds": 10637, "write": 49489, "context": 13714, "current": 14664, "user": 46017, "exploitation": 18171, "requires": 36292, "interaction": 24306, "victim": 47512, "must": 29010, "open": 31024, "malicious": 27387, "bmp": 10558, "adobe animate": 5848, "animate version": 7760, "version 21": 47105, "21 and": 2892, "earlier are": 16680, "affected by": 5961, "by an": 10990, "an out": 6816, "out of": 31797, "of bounds": 30235, "bounds write": 10650, "write vulnerability": 49525, "vulnerability that": 47925, "that could": 41373, "could result": 14116, "in arbitrary": 22409, "execution in": 17996, "the context": 41787, "context of": 13720, "the current": 41821, "current user": 14672, "user exploitation": 46072, "exploitation of": 18178, "issue requires": 25177, "requires user": 36300, "user interaction": 46096, "interaction in": 24312, "in that": 23313, "that victim": 41487, "victim must": 47527, "must open": 29017, "open malicious": 31033, "bmp file": 10559, "11": 1356, "inclusive": 23569, "distributed": 16060, "did": 15764, "discard": 15928, "ip": 24593, "packets": 32080, "response": 36456, "master": 27715, "potential": 33767, "remediated": 35943, "release": 35864, "source": 39564, "patches": 32581, "to 11": 43784, "distributed with": 16064, "plugin versions": 33420, "did not": 15765, "ip packets": 24614, "packets with": 32103, "with an": 48981, "long response": 27059, "server allowing": 38190, "allowing remote": 6421, "service in": 38408, "the issue": 42204, "issue has": 25160, "with source": 49126, "source code": 39569, "zimbra": 49954, "collaboration": 12780, "suite": 40443, "patch": 32549, "persistent": 32929, "zimbra collaboration": 49955, "collaboration suite": 12782, "suite before": 40449, "before 11": 9964, "11 patch": 1437, "patch and": 32554, "and before": 7026, "patch has": 32559, "has persistent": 21077, "persistent xss": 32932, "forum": 19772, "post": 33721, "moodle": 28734, "consider": 13485, "copy": 13932, "groups": 20802, "actions": 5477, "bypass": 11215, "intended": 24282, "restrictions": 36547, "leveraging": 26354, "per": 32770, "group": 20787, "authorization": 9342, "post php": 33735, "in moodle": 22940, "moodle before": 28735, "before does": 10107, "not consider": 29704, "consider the": 13486, "the mod": 42353, "to all": 43889, "actions which": 5493, "remote authenticated": 35958, "to bypass": 43957, "bypass intended": 11234, "intended access": 24283, "access restrictions": 5275, "restrictions by": 36549, "by leveraging": 11093, "internet": 24398, "routing": 36876, "daemon": 14832, "through": 43454, "stack": 39958, "based": 9635, "bgp": 10357, "support": 40509, "rfc": 36700, "administrative": 5780, "shutdown": 38832, "communication": 12980, "messages": 28150, "included": 23510, "logical": 26972, "expression": 18273, "checking": 12175, "validity": 46856, "sufficient": 40421, "causes": 11785, "four": 19812, "byte": 11273, "occur": 30124, "while": 48675, "two": 45140, "bytes": 11279, "controlled": 13809, "fixed": 19159, "through and": 43518, "and through": 7604, "through has": 43538, "has stack": 21090, "stack based": 39962, "based buffer": 9643, "overflow the": 31889, "the bgp": 41642, "support for": 40515, "an incorrect": 6753, "when checking": 48461, "checking the": 12184, "the validity": 43013, "validity of": 46857, "of an": 30196, "an input": 6762, "communication with": 12992, "with sufficient": 49135, "overflow to": 31891, "to occur": 44360, "occur while": 30136, "while processing": 48691, "processing the": 34293, "the message": 42336, "the overflow": 42476, "bytes are": 11283, "attacker controlled": 9071, "portal": 33597, "magic_quotes_gpc": 27281, "disabled": 15908, "top": 44771, "uri": 45855, "portal system": 33609, "when magic_quotes_gpc": 48505, "magic_quotes_gpc is": 27282, "is disabled": 24812, "disabled allows": 15910, "parameter to": 32310, "the top": 42948, "top level": 44772, "possibly related": 33713, "sps": 39838, "cwe": 14757, "327": 3488, "broken": 10715, "risky": 36755, "cryptographic": 14586, "algorithm": 6260, "use of": 45967, "of broken": 30236, "broken or": 10718, "or risky": 31470, "risky cryptographic": 36756, "cryptographic algorithm": 14587, "no": 29552, "limit": 26547, "failed": 18452, "login": 26973, "attempts": 9163, "permitted": 32923, "serial": 38106, "brute": 10757, "force": 19620, "gain": 20328, "then": 43175, "make": 27341, "changes": 12072, "device": 15589, "settings": 38625, "disrupt": 16044, "function": 20185, "disclosure": 15945, "is no": 24935, "limit on": 26551, "the number": 42429, "number of": 29978, "of failed": 30316, "failed login": 18454, "login attempts": 26980, "password or": 32500, "or the": 31491, "the serial": 42794, "serial number": 38107, "password an": 32468, "could execute": 14082, "brute force": 10758, "force attack": 19622, "attack to": 9045, "to gain": 44170, "gain unauthorized": 20351, "unauthorized access": 45341, "and then": 7597, "make changes": 27345, "changes to": 12077, "to device": 44064, "device settings": 15647, "settings that": 38640, "disrupt the": 16046, "the function": 42040, "function of": 20216, "the device": 41864, "device and": 15594, "and or": 7399, "unauthorized information": 45357, "information disclosure": 23740, "heap": 21271, "overflows": 31902, "openoffice": 31106, "org": 31634, "pro": 34161, "attribute": 9172, "font": 19327, "description": 15440, "records": 35639, "multiple heap": 28963, "heap based": 21273, "buffer overflows": 10808, "overflows in": 31903, "in openoffice": 23009, "openoffice org": 31107, "before allow": 10078, "allow remote": 6386, "service crash": 38380, "crash and": 14399, "and possibly": 7436, "possibly execute": 33702, "file with": 18856, "with crafted": 49009, "linux": 26651, "kernel": 25755, "following": 19306, "resolved": 36348, "remove": 36012, "dangling": 14858, "pointers": 33506, "async": 8920, "control": 13764, "written": 49541, "we": 48160, "started": 40015, "operation": 31168, "will": 48777, "done": 16287, "future": 20300, "if": 22012, "closes": 12559, "descriptor": 15448, "its": 25323, "structure": 40268, "freed": 19943, "one": 30893, "pending": 32750, "driver": 16423, "try": 45083, "clean": 12406, "during": 16568, "avoid": 9461, "adding": 5585, "performance": 32830, "most": 28753, "common": 12958, "case": 11668, "counter": 14135, "introduced": 24462, "logic": 26961, "sure": 40543, "handled": 20937, "the linux": 42272, "linux kernel": 26665, "kernel the": 25817, "the following": 42017, "following vulnerability": 19322, "vulnerability has": 47889, "been resolved": 9941, "resolved media": 36378, "when an": 48447, "control is": 13782, "is written": 25102, "pointer to": 33501, "the operation": 42454, "operation that": 31175, "will be": 48784, "used when": 46007, "when the": 48545, "device is": 15623, "is done": 24817, "which could": 48620, "could be": 14069, "the future": 42043, "if the": 22036, "the user": 43004, "that file": 41392, "file descriptor": 18740, "be freed": 9756, "freed and": 19944, "and there": 7598, "there will": 43211, "dangling pointer": 14859, "control that": 13799, "that the": 41471, "the driver": 41898, "driver will": 16463, "will try": 48815, "try to": 45084, "to use": 44630, "all the": 6313, "release to": 35875, "to avoid": 43932, "the most": 42370, "been introduced": 9933, "with some": 49125, "logic to": 26971, "to make": 44316, "make sure": 27351, "sure that": 40544, "that it": 41412, "is properly": 24976, "properly handled": 34525, "subcomponent": 40312, "15": 1818, "high": 21358, "server component": 38209, "component of": 13100, "mysql subcomponent": 29056, "subcomponent server": 40319, "are 15": 8400, "15 and": 1854, "allows high": 6463, "high privileged": 21367, "ox": 31969, "app": 7991, "metrics": 28236, "help": 21298, "module": 28650, "demonstrated": 15344, "io": 24537, "cap": 11597, "ox app": 31970, "app suite": 8014, "suite through": 40454, "through 10": 43463, "10 allows": 1159, "allows xss": 6509, "via malicious": 47433, "capability to": 11611, "module as": 28655, "as demonstrated": 8701, "demonstrated by": 15345, "improper": 22286, "limitation": 26554, "pathname": 32625, "restricted": 36529, "directory": 15858, "mh": 28250, "board": 10569, "inclusion": 23561, "improper limitation": 22307, "limitation of": 26555, "of pathname": 30462, "pathname to": 32630, "to restricted": 44492, "restricted directory": 36531, "directory path": 15879, "traversal vulnerability": 44947, "board allows": 10570, "allows php": 6482, "php local": 33068, "local file": 26818, "file inclusion": 18772, "inclusion this": 23565, "from through": 20077, "hyperion": 21801, "financial": 18999, "close": 12556, "difficult": 15789, "require": 36265, "person": 32935, "than": 41314, "insert": 24048, "delete": 15275, "accessible": 5315, "integrity": 24239, "the hyperion": 42122, "hyperion financial": 21804, "management product": 27533, "oracle hyperion": 31565, "hyperion component": 21803, "manager the": 27608, "the supported": 42896, "supported version": 40531, "version that": 47169, "that is": 41411, "is affected": 24732, "affected is": 5975, "is 11": 24718, "11 difficult": 1414, "difficult to": 15791, "to exploit": 44130, "exploit vulnerability": 18145, "via http": 47409, "http to": 21724, "compromise hyperion": 13149, "management successful": 27539, "attacks require": 9146, "require human": 36270, "human interaction": 21772, "interaction from": 24309, "from person": 20055, "person other": 32936, "other than": 31768, "than the": 41327, "attacker successful": 9094, "unauthorized update": 45365, "update insert": 45718, "insert or": 24051, "or delete": 31326, "delete access": 15276, "to some": 44541, "some of": 39519, "of hyperion": 30352, "management accessible": 27490, "accessible data": 5318, "data cvss": 14905, "score integrity": 37475, "integrity impacts": 24244, "configuration": 13311, "jsf": 25624, "glassfish": 20599, "webadmin": 48292, "sun": 40462, "java": 25393, "build": 10865, "different": 15774, "cve": 14710, "2008": 2430, "in configuration": 22533, "interface in": 24350, "in sun": 23277, "sun java": 40463, "java system": 25418, "system application": 40711, "application server": 8147, "the name": 42387, "name parameter": 29088, "parameter different": 32286, "different vector": 15784, "vector than": 46994, "than cve": 41320, "cve 2008": 14718, "central": 11868, "phone": 32994, "320": 3477, "sip": 39002, "calls": 11432, "call": 11380, "field": 18652, "note": 29842, "overlap": 31911, "2007": 2418, "3440": 3521, "web interface": 48251, "interface on": 24354, "the central": 41705, "server for": 38233, "for the": 19578, "make arbitrary": 27343, "phone calls": 32996, "the call": 41686, "field note": 18662, "note this": 29860, "this might": 43359, "might overlap": 28349, "overlap cve": 31912, "cve 2007": 14717, "neutralization": 29388, "formula": 19740, "elements": 16986, "csv": 14634, "fortinet": 19756, "specially": 39695, "improper neutralization": 22311, "neutralization of": 29389, "of formula": 30326, "formula elements": 19741, "elements in": 16991, "in csv": 22560, "csv file": 14635, "file in": 18770, "in fortinet": 22673, "version through": 47173, "through through": 43568, "10 through": 1208, "through allows": 43516, "allows attacker": 6441, "execute unauthorized": 17947, "unauthorized code": 45349, "code or": 12711, "or commands": 31307, "via specially": 47476, "specially crafted": 39697, "crafted packets": 14323, "joomla": 25562, "in joomla": 22808, "joomla before": 25566, "before allows": 10080, "mattermost": 27753, "fails": 18459, "validate": 46796, "gif": 20547, "image": 22117, "consume": 13533, "significant": 38909, "amount": 6608, "resources": 36423, "making": 27365, "unresponsive": 45587, "extended": 18295, "period": 32847, "time": 43665, "linking": 26639, "mattermost fails": 27754, "fails to": 18463, "to properly": 44433, "properly validate": 34549, "gif image": 20549, "image file": 22125, "file allowing": 18706, "allowing an": 6412, "to consume": 44008, "amount of": 6609, "of server": 30516, "making the": 27371, "the server": 42796, "for an": 19360, "an extended": 6726, "period of": 32848, "of time": 30577, "to specially": 44542, "crafted image": 14284, "core": 13948, "rdbms": 35381, "database": 15007, "12": 1526, "having": 21193, "logon": 27018, "privilege": 34067, "read": 35413, "subset": 40373, "applicable": 8083, "windows": 48842, "platform": 33277, "confidentiality": 13294, "the core": 41796, "core rdbms": 13970, "rdbms component": 35382, "oracle database": 31546, "database server": 15040, "server supported": 38296, "are 11": 8397, "11 12": 1367, "12 and": 1564, "and 12": 6910, "12 difficult": 1572, "attacker having": 9079, "privilege with": 34094, "unauthorized read": 45362, "read access": 35414, "to subset": 44561, "subset of": 40374, "of core": 30269, "data note": 14942, "only to": 30980, "to windows": 44669, "windows platform": 48899, "platform cvss": 33288, "score confidentiality": 37473, "confidentiality impacts": 13296, "snowflake": 39329, "hive": 21429, "connector": 13460, "provides": 34686, "easy": 16742, "way": 48135, "query": 34983, "managed": 27474, "addressed": 5654, "elevation": 17007, "helper": 21303, "insider": 24069, "without": 49177, "download": 16348, "microsoft": 28280, "domain": 16253, "replace": 36073, "valid": 46777, "had": 20908, "same": 37240, "maliciously": 27453, "modified": 28610, "run": 36994, "they": 43244, "attempt": 9157, "manipulate": 27631, "into": 24428, "executing": 17969, "gaining": 20354, "elevated": 17001, "patched": 32573, "february": 18582, "09": 447, "2024": 2833, "who": 48710, "strongly": 40265, "advised": 5914, "latest": 26150, "soon": 39549, "unable": 45304, "should": 38790, "the snowflake": 42842, "provides an": 34687, "way to": 48143, "to query": 44444, "data via": 14997, "elevation of": 17008, "of privilege": 30475, "privilege vulnerability": 34093, "script for": 37511, "admin privileges": 5746, "privileges could": 34128, "use the": 45971, "the script": 42772, "script to": 37529, "to download": 44088, "content from": 13670, "domain to": 16270, "the local": 42278, "local system": 26841, "system and": 40709, "and replace": 7488, "replace the": 36074, "the valid": 43011, "content with": 13702, "with malicious": 49071, "malicious code": 27399, "code if": 12695, "local access": 26799, "the same": 42755, "system where": 40830, "where the": 48582, "script is": 37516, "is run": 25012, "they could": 43249, "attempt to": 9158, "to manipulate": 44321, "users into": 46252, "into executing": 24438, "executing the": 17976, "elevated privileges": 17006, "privileges to": 34152, "system the": 40809, "the vulnerability": 43050, "was patched": 48090, "patched on": 32576, "the connector": 41780, "user who": 46189, "who use": 48726, "the helper": 42095, "advised to": 5915, "the latest": 42247, "latest version": 26151, "version as": 47137, "as soon": 8761, "soon as": 39550, "as possible": 8747, "users unable": 46273, "unable to": 45305, "upgrade should": 45759, "should avoid": 38792, "avoid using": 9469, "using the": 46340, "online": 30932, "discussion": 15996, "declared": 15171, "functionality": 20245, "posts": 33754, "launched": 26160, "associated": 8890, "sourcecodester online": 39595, "discussion forum": 15997, "been declared": 9917, "declared as": 15172, "critical affected": 14534, "by this": 11189, "is an": 24739, "an unknown": 6846, "unknown functionality": 45521, "functionality of": 20257, "argument id": 8563, "id leads": 21917, "attack can": 9018, "be launched": 9775, "launched remotely": 26161, "used the": 46001, "the associated": 41593, "associated identifier": 8892, "identifier of": 21962, "is vdb": 25089, "cybozu": 14776, "office": 30649, "cybozu office": 14778, "office 10": 30650, "10 to": 1210, "to 10": 43776, "service via": 38479, "libav": 26387, "infinite": 23707, "loop": 27084, "in libav": 22832, "libav 12": 26388, "12 there": 1607, "an infinite": 6756, "infinite loop": 23708, "loop in": 27088, "discovered": 15979, "search": 37714, "link": 26592, "form": 19670, "reflected": 35770, "targeting": 41024, "administrator": 5797, "stealing": 40107, "an issue": 6785, "issue was": 25190, "was discovered": 48065, "discovered in": 15983, "before the": 10191, "the search": 42778, "file by": 18723, "form is": 19681, "by reflected": 11146, "reflected xss": 35774, "xss that": 49819, "an administrator": 6639, "session and": 38539, "administrative privileges": 5793, "after": 6084, "free": 19893, "v8": 46749, "96": 4974, "4664": 3949, "110": 1464, "corruption": 14024, "use after": 45955, "after free": 6092, "free in": 19912, "in v8": 23378, "v8 in": 46756, "to 96": 43863, "96 4664": 4975, "to potentially": 44415, "potentially exploit": 33806, "exploit heap": 18136, "heap corruption": 21275, "corruption via": 14044, "crafted html": 14281, "html page": 21666, "redirection": 35691, "untrusted": 45649, "redirect": 35674, "fv": 20304, "flowplayer": 19258, "video": 47539, "player": 33333, "44": 3908, "url redirection": 45898, "redirection to": 35692, "to untrusted": 44624, "untrusted site": 45658, "site open": 39045, "open redirect": 31037, "redirect vulnerability": 35686, "video player": 47548, "player from": 33340, "forgery": 19649, "csrf": 14608, "rest": 36490, "api": 7927, "site request": 39051, "request forgery": 36181, "forgery csrf": 19652, "csrf vulnerability": 14626, "rest api": 36491, "api to": 7971, "allows cross": 6450, "forgery this": 19657, "grandstream": 20735, "series": 38118, "firmware": 19063, "20": 2307, "23": 2993, "below": 10284, "get": 20506, "old": 30698, "https": 21736, "series firmware": 38139, "firmware version": 19095, "version 20": 47097, "23 and": 3008, "and below": 7027, "below is": 10295, "injection via": 23925, "attacker can": 9067, "can execute": 11500, "execute commands": 17919, "commands as": 12907, "as the": 8768, "the root": 42733, "root user": 36832, "user by": 46040, "crafted http": 14282, "http get": 21694, "lan": 26072, "allows an": 6437, "with administrative": 48978, "administrative privilege": 5792, "privilege to": 34089, "arbitrary os": 8323, "os commands": 31685, "v3": 46591, "controllers": 13843, "db": 15080, "v3 and": 46603, "below was": 10305, "discovered to": 15986, "to contain": 44010, "contain an": 13566, "an arbitrary": 6656, "arbitrary file": 8304, "file upload": 18838, "upload vulnerability": 45805, "vulnerability via": 47935, "app admin": 7992, "db php": 15082, "hp": 21597, "homepage": 21461, "smh": 39243, "hijack": 21389, "authentication": 9264, "administrators": 5833, "requests": 36237, "accounts": 5373, "in hp": 22747, "hp system": 21608, "system management": 40767, "management homepage": 27518, "homepage smh": 21462, "to hijack": 44200, "hijack the": 21392, "the authentication": 41610, "authentication of": 9298, "of administrators": 30191, "administrators for": 5836, "for requests": 19549, "requests that": 36255, "that create": 41374, "create administrative": 14437, "administrative accounts": 5783, "samsung": 37271, "sm": 39191, "galaxy": 20360, "s6": 37152, "devices": 15676, "sve": 40576, "2015": 2493, "devices has": 15692, "has sql": 21089, "allen": 6319, "bradley": 10670, "micrologix": 28271, "1100": 1465, "frn": 19989, "000": 40, "1400": 1799, "003": 175, "web server": 48271, "server on": 38267, "allen bradley": 6320, "bradley micrologix": 10671, "micrologix 1100": 28272, "devices before": 15683, "000 and": 41, "flash": 19196, "183": 2141, "mac": 27216, "solaris": 39465, "186": 2149, "android": 7700, "air": 6166, "2011": 2464, "in adobe": 22374, "adobe flash": 5858, "flash player": 19199, "player before": 33338, "10 183": 1135, "on windows": 30877, "windows mac": 48890, "mac os": 27224, "os linux": 31694, "linux and": 26655, "and solaris": 7553, "solaris and": 39470, "on android": 30729, "android and": 7717, "and adobe": 6985, "adobe air": 5847, "air before": 6167, "before on": 10158, "windows and": 48854, "and mac": 7325, "os and": 31682, "android allows": 7716, "allows attackers": 6442, "vectors different": 47000, "different vulnerability": 15786, "vulnerability than": 47924, "cve 2011": 14721, "and cve": 7102, "xml": 49717, "external": 18339, "entity": 17392, "xee": 49680, "exists": 18067, "cockpit": 12666, "sos": 39560, "13": 1661, "declaration": 15167, "any": 7813, "documents": 16225, "specify": 39748, "jobs": 25554, "orders": 31631, "an xml": 6872, "xml external": 49727, "external entity": 18345, "vulnerability exists": 47883, "exists in": 18072, "and 13": 6911, "13 allows": 1679, "to read": 44451, "read files": 35432, "files from": 18910, "from the": 20071, "server via": 38318, "an entity": 6699, "entity declaration": 17393, "declaration in": 15168, "in any": 22394, "any of": 7839, "the xml": 43106, "xml documents": 49723, "documents that": 16228, "are used": 8530, "to specify": 44545, "specify the": 39750, "the run": 42747, "run time": 37011, "settings of": 38635, "shtml": 38829, "controller": 13822, "msg": 28857, "the msg": 42379, "msg parameter": 28858, "rhashtable": 36710, "fix": 19119, "deadlock": 15131, "moving": 28785, "lock": 26884, "move": 28775, "hash": 21105, "table": 40907, "growth": 20813, "work": 49328, "scheduling": 37443, "prevent": 33945, "circular": 12282, "locking": 26905, "dependency": 15365, "original": 31656, "implementation": 22245, "trigger": 44992, "lockdep": 26898, "warning": 48033, "scenario": 37423, "involving": 24533, "nested": 29201, "locks": 26915, "between": 10340, "bucket": 10781, "rq": 36902, "releasing": 35909, "break": 10687, "change": 12040, "expands": 18095, "removing": 36028, "previously": 33972, "limited": 26557, "scheduler": 37440, "workqueue": 49373, "contexts": 13727, "import": 22272, "say": 37370, "reads": 35530, "struct": 40267, "holding": 21446, "problem": 34188, "schedule": 37438, "so": 39336, "moved": 28777, "along": 6517, "75": 4567, "fix potential": 19142, "potential deadlock": 33772, "by moving": 11112, "move the": 28776, "the hash": 42087, "hash table": 21110, "check and": 12139, "lock to": 26895, "to prevent": 44419, "circular locking": 12283, "locking dependency": 26906, "the original": 42467, "could trigger": 14124, "to potential": 44414, "lock and": 26885, "releasing the": 35910, "this change": 43298, "by removing": 11149, "use in": 45965, "that this": 41477, "holding the": 21448, "the lock": 42281, "if this": 22041, "this is": 43343, "we can": 48164, "the check": 41721, "check to": 12159, "the workqueue": 43093, "after the": 6102, "so that": 39347, "is also": 24737, "outside of": 31831, "the bucket": 41671, "along with": 6518, "ossec": 31720, "nix": 29533, "systems": 40841, "through on": 43551, "systems allows": 40842, "allows local": 6467, "code as": 12675, "as root": 8755, "guest": 20852, "book": 10589, "certain": 11883, "comment": 12935, "fields": 18677, "sign": 38871, "our": 31791, "guestbook": 20867, "probably": 34177, "asp": 8828, "via certain": 47377, "fields in": 18683, "the sign": 42820, "updating": 45749, "rollback": 36801, "ta": 40903, "ota": 31723, "enabled": 17130, "memory corruption": 28026, "corruption in": 14033, "in core": 22545, "when updating": 48552, "version for": 47151, "feature is": 18562, "is enabled": 24826, "vulnerabilities": 47824, "ca": 11326, "multiple directory": 28957, "directory traversal": 15891, "traversal vulnerabilities": 44946, "vulnerabilities in": 47837, "in ca": 22476, "web portal": 48262, "obtain sensitive": 30102, "woo": 49279, "sanitise": 37303, "escape": 17597, "parameters": 32319, "outputting": 31826, "them": 43144, "back": 9526, "pages": 32186, "leading": 26202, "against": 6115, "wordpress plugin": 49320, "plugin before": 33390, "not sanitise": 29805, "sanitise and": 37304, "and escape": 7165, "escape some": 17604, "some parameters": 39522, "parameters before": 32326, "before outputting": 10161, "outputting them": 31828, "them back": 43147, "back in": 9529, "in pages": 23037, "leading to": 26203, "to reflected": 44461, "reflected cross": 35772, "scripting which": 37554, "used against": 45984, "against high": 6117, "high privilege": 21366, "privilege users": 34091, "users such": 46267, "as admin": 8672, "tungsten": 45105, "automation": 9391, "power": 33821, "xps": 49767, "installations": 24102, "required": 36277, "target": 41004, "visit": 47691, "specific": 39698, "flaw": 19208, "within": 49168, "results": 36583, "lack": 26057, "validating": 46816, "existence": 18057, "object": 30026, "performing": 32839, "operations": 31183, "leverage": 26343, "zdi": 49920, "tungsten automation": 45106, "automation power": 9400, "power pdf": 33828, "xps file": 49768, "file parsing": 18802, "parsing use": 32398, "free remote": 19925, "execution vulnerability": 18018, "vulnerability this": 47928, "code on": 12710, "on affected": 30724, "affected installations": 5973, "installations of": 24104, "of tungsten": 30585, "pdf user": 32728, "interaction is": 24313, "is required": 25003, "required to": 36282, "the target": 42910, "target must": 41012, "must visit": 29019, "visit malicious": 47693, "malicious page": 27425, "page or": 32151, "or open": 31430, "malicious file": 27407, "file the": 18829, "the specific": 42858, "specific flaw": 39710, "flaw exists": 19215, "exists within": 18080, "within the": 49173, "the parsing": 42500, "parsing of": 32393, "files the": 18935, "issue results": 25178, "results from": 36584, "the lack": 42241, "lack of": 26058, "of validating": 30605, "validating the": 46818, "the existence": 41950, "existence of": 18058, "an object": 6793, "object prior": 30041, "to performing": 44394, "performing operations": 32842, "operations on": 31197, "the object": 42434, "object an": 30028, "can leverage": 11524, "leverage this": 26347, "vulnerability to": 47930, "execute code": 17917, "code in": 12696, "current process": 14670, "process was": 34253, "was zdi": 48107, "zdi can": 49921, "engine": 17276, "register_globals": 35797, "php remote": 33087, "remote file": 35972, "inclusion vulnerability": 23568, "earlier when": 16723, "when register_globals": 48528, "register_globals is": 35798, "enabled allows": 17132, "via url": 47502, "url in": 45888, "kde": 25740, "sc": 37379, "sequences": 38095, "element": 16956, "in kde": 22819, "to create": 44032, "create arbitrary": 14440, "arbitrary files": 8305, "files via": 18944, "via directory": 47391, "traversal sequences": 44940, "sequences in": 38097, "name attribute": 29070, "attribute of": 9177, "of file": 30319, "element in": 16958, "dashboard": 14871, "hooked": 21472, "retrieve": 36613, "credentials": 14494, "the system": 42904, "dashboard plugin": 14874, "access of": 5256, "data due": 14911, "function hooked": 20206, "an ajax": 6643, "to retrieve": 44494, "retrieve sensitive": 36619, "information such": 23776, "database credentials": 15021, "running": 37019, "tcp": 41063, "port": 33576, "enables": 17154, "start": 40008, "stop": 40136, "sanitation": 37299, "supplied": 40486, "job": 25548, "provided": 34668, "send": 37979, "payload": 32651, "enable": 17118, "another": 7776, "string": 40225, "the scheduler": 42765, "service running": 38458, "running on": 37027, "on specific": 30834, "tcp port": 41075, "enables the": 17157, "user to": 46176, "to start": 44551, "start and": 40009, "and stop": 7572, "the supplied": 42893, "provided to": 34676, "function an": 20189, "attacker may": 9083, "may send": 27817, "send malicious": 37990, "malicious payload": 27427, "payload that": 32664, "can enable": 11496, "enable the": 17128, "sending specific": 38024, "sap": 37335, "hana": 20919, "00": 0, "packet": 32049, "kill": 25917, "16": 1913, "17": 1999, "method": 28201, "security": 37822, "sap hana": 37341, "earlier do": 16689, "do not": 16158, "not require": 29795, "require authentication": 36269, "authentication which": 9322, "or have": 31364, "packet to": 32076, "aka sap": 6223, "sap security": 37345, "security note": 37880, "sufficiently": 40425, "userspace": 46284, "vm": 47737, "exposes": 18249, "achieve": 5394, "host": 21497, "bhyve": 10363, "typically": 45194, "runs": 37035, "sandbox": 37283, "constrained": 13517, "capabilities": 11600, "available": 9429, "iscsi": 25115, "not sufficiently": 29815, "sufficiently validate": 40429, "provided by": 34670, "arbitrary write": 8359, "write to": 49522, "to limited": 44295, "of kernel": 30387, "malicious software": 27441, "software running": 39442, "running in": 37026, "in guest": 22729, "guest vm": 20866, "that exposes": 41391, "can exploit": 11501, "exploit the": 18141, "the vulnerabilities": 43049, "vulnerabilities to": 47845, "to achieve": 43873, "achieve code": 5397, "execution on": 18002, "the host": 42105, "host in": 21507, "process which": 34255, "runs as": 37036, "note that": 29855, "runs in": 37037, "code is": 12703, "constrained by": 13518, "by the": 11186, "the capabilities": 41692, "available to": 9440, "achieve remote": 5400, "target host": 41010, "simple": 38952, "list": 26692, "implement": 22242, "nonce": 29631, "checks": 12192, "logged": 26948, "new": 29394, "the simple": 42825, "simple file": 38957, "file list": 18782, "before 12": 9968, "12 does": 1573, "not implement": 29751, "nonce checks": 29633, "checks which": 12207, "allow attackers": 6362, "make logged": 27348, "logged in": 26949, "in admin": 22370, "create new": 14449, "new page": 29403, "page and": 32123, "and change": 7054, "content via": 13699, "via csrf": 47385, "csrf attack": 14610, "improved": 22335, "handling": 20968, "ipados": 24631, "macos": 27248, "catalina": 11706, "tvos": 45125, "watchos": 48115, "corruption issue": 14034, "was addressed": 48047, "addressed with": 5659, "with improved": 49046, "improved memory": 22343, "memory handling": 28037, "handling this": 20980, "issue is": 25166, "is fixed": 24842, "fixed in": 19163, "in ios": 22784, "ios 13": 24565, "13 and": 1681, "and ipados": 7269, "ipados 13": 24632, "13 macos": 1698, "macos catalina": 27253, "catalina 10": 11707, "10 15": 1127, "15 tvos": 1884, "tvos 13": 45127, "13 watchos": 1714, "watchos an": 48118, "an application": 6654, "application may": 8134, "be able": 9689, "code with": 12737, "with system": 49138, "system privileges": 40786, "rockwell": 36786, "because": 9884, "permission": 32860, "assignment": 8876, "requiring": 36301, "factory": 18443, "reset": 36320, "restore": 36517, "ancillary": 6902, "still": 40122, "capacity": 11614, "in rockwell": 23168, "rockwell automation": 36787, "series and": 38131, "and version": 7662, "version 14": 47090, "prior versions": 34036, "versions and": 47240, "because of": 9891, "incorrect permission": 23605, "permission assignment": 32862, "assignment for": 8877, "for critical": 19399, "critical resource": 14541, "users with": 46282, "with administrator": 48979, "administrator privileges": 5820, "privileges may": 34139, "to remove": 44472, "remove all": 36013, "administrative users": 5795, "factory reset": 18444, "reset to": 36328, "to restore": 44490, "vulnerability will": 47941, "will still": 48812, "affected device": 5966, "device to": 15654, "to function": 44166, "function in": 20208, "in its": 22792, "repair": 36062, "services": 38489, "launch": 26155, "critical was": 14546, "repair and": 36063, "and services": 7536, "system affected": 40704, "unknown function": 45520, "master php": 27724, "component http": 13085, "http post": 21709, "post request": 33736, "request handler": 36184, "injection it": 23912, "to launch": 44285, "launch the": 26159, "attack remotely": 9036, "outlook": 31814, "view": 47561, "activex": 5511, "2002": 2373, "microsoft outlook": 28300, "activex control": 5512, "control in": 13781, "in microsoft": 22924, "earlier allows": 16676, "arbitrary commands": 8297, "malicious html": 27412, "html mail": 21663, "message or": 28135, "or web": 31515, "web page": 48257, "exe": 17887, "program": 34410, "novell": 29894, "netware": 29306, "01": 236, "temporarily": 41189, "writes": 49532, "disk": 15999, "exe program": 17899, "program in": 34417, "in novell": 22987, "novell netware": 29898, "and 01": 6906, "user name": 46119, "name and": 29068, "and password": 7417, "password information": 32491, "information to": 23783, "to disk": 44075, "allow local": 6377, "gain privileges": 20344, "apple": 8042, "insecurely": 24045, "logs": 27024, "portable": 33596, "home": 21451, "client for": 12494, "for apple": 19366, "apple mac": 8047, "os 10": 31669, "10 up": 1212, "home directory": 21454, "credentials which": 14525, "obtain the": 30106, "the credentials": 41812, "injecting": 23886, "customer": 14691, "scripting vulnerability": 37552, "gain administrative": 20332, "by injecting": 11077, "injecting the": 23891, "script into": 37515, "ibm": 21829, "appscan": 8241, "enterprise": 17340, "multiple sql": 28981, "injection vulnerabilities": 23926, "in ibm": 22756, "ibm security": 21869, "security appscan": 37834, "appscan enterprise": 8242, "enterprise and": 17343, "unspecified parameters": 45624, "gitlab": 20571, "ce": 11835, "ee": 16883, "affecting": 6006, "starting": 40019, "under": 45399, "conditions": 13248, "ci": 12262, "artifacts": 8650, "metadata": 28189, "background": 9548, "become": 9898, "been discovered": 9922, "in gitlab": 22708, "gitlab ce": 20574, "ce ee": 11837, "ee affecting": 16884, "affecting all": 6007, "versions starting": 47286, "starting from": 40021, "from 15": 19999, "15 